{
	"id": "4435981684df205b2805a2b40f0672cc",
	"_format": "hh-sol-build-info-1",
	"solcVersion": "0.5.17",
	"solcLongVersion": "0.5.17+commit.d19bba13",
	"input": {
		"language": "Solidity",
		"sources": {
			"functions.sol": {
				"content": "/*In Solidity, view and public are function modifiers that control how functions interact with the blockchain and their visibility. Here's a quick overview:\r\n\r\npublic\r\nVisibility Modifier: \r\npublic: functions can be called both internally within the contract and externally by other contracts or transactions.\r\ninternal: Can only be called from within the contract itself or from derived contracts.\r\nprivate: Can only be called from within the contract itself and not from derived contracts or externally.\r\nexternal: Can only be called from outside the contract (e.g., by transactions or other contracts) and not from within the contract.\r\n\r\nview: Indicates that the function does not modify the contract's state (i.e., it only reads from the blockchain and does not alter data). It can access state variables but cannot change them.\r\npure: The function does not read from or modify the contract’s state. It only depends on its input parameters and returns a result based on that. It is used for functions that are entirely self-contained and do not interact with the contract’s storage.\r\nNo modifier: Functions without view or pure modifiers can modify the contract’s state. These functions can change state variables or perform other actions that affect the blockchain.\r\n\r\nHere's how different combinations might look:\r\n\r\npublic view: Can be called both internally and externally, and does not modify state.\r\npublic pure: Can be called both internally and externally, and does not read or modify state.\r\ninternal view: Can only be called internally or by derived contracts, and does not modify state.\r\nprivate pure: Can only be called within the contract itself, and does not read or modify state.\r\nexternal: Can only be called from outside the contract, with or without state-modifying capabilities.\r\n*/\r\n\r\n// SPDX-License-Identifier: MIT\r\n\r\npragma solidity ^0.5.0;\r\n\r\n\r\n"
			}
		},
		"settings": {
			"optimizer": {
				"enabled": false,
				"runs": 200
			},
			"outputSelection": {
				"*": {
					"": [
						"ast"
					],
					"*": [
						"abi",
						"metadata",
						"devdoc",
						"userdoc",
						"storageLayout",
						"evm.legacyAssembly",
						"evm.bytecode",
						"evm.deployedBytecode",
						"evm.methodIdentifiers",
						"evm.gasEstimates",
						"evm.assembly"
					]
				}
			},
			"remappings": []
		}
	},
	"output": {
		"sources": {
			"functions.sol": {
				"ast": {
					"absolutePath": "functions.sol",
					"exportedSymbols": {},
					"id": 2,
					"nodeType": "SourceUnit",
					"nodes": [
						{
							"id": 1,
							"literals": [
								"solidity",
								"^",
								"0.5",
								".0"
							],
							"nodeType": "PragmaDirective",
							"src": "1851:23:0"
						}
					],
					"src": "1851:29:0"
				},
				"id": 0
			}
		}
	}
}